; domain
(define (domain keys-doors-simple)
  (:requirements :strips :typing)
  (:types location key door agent)
  (:predicates
    (at ?a - agent ?l - location)
    (key-at ?k - key ?l - location)
    (has-key ?a - agent ?k - key)
    (door-between ?d - door ?l1 ?l2 - location)
    (locked ?d - door)
    (unlocks ?k - key ?d - door)
  )

  (:action move
   :parameters (?a - agent ?from ?to - location ?d - door)
   :precondition (and (at ?a ?from) (door-between ?d ?from ?to) (not (locked ?d)))
   :effect (and (not (at ?a ?from)) (at ?a ?to))
  )

  (:action pick-key
   :parameters (?a - agent ?k - key ?l - location)
   :precondition (and (at ?a ?l) (key-at ?k ?l))
   :effect (and (not (key-at ?k ?l)) (has-key ?a ?k))
  )

  (:action unlock
   :parameters (?a - agent ?k - key ?d - door ?l - location)
   :precondition (and (at ?a ?l) (has-key ?a ?k) (unlocks ?k ?d) (locked ?d))
   :effect (not (locked ?d))
  )
)

; problem
(define (problem quest-medium)
  (:domain keys-doors-simple)
  (:objects
    entrance hall treasure_room secret_chamber - location
    hero - agent
    bronze_key golden_key - key
    main_door treasure_door - door
  )
  (:init
    (at hero entrance)
    (key-at bronze_key entrance)
    (key-at golden_key hall)

    (door-between main_door entrance hall)
    (door-between treasure_door hall treasure_room)

    (locked main_door)
    (locked treasure_door)

    (unlocks bronze_key main_door)
    (unlocks golden_key treasure_door)
  )
  (:goal
    (at hero treasure_room)
  )
)

; plan
1. (pick-key hero bronze_key entrance)
   deleted: (key-at bronze_key entrance)
   added: (has-key hero bronze_key)
   goals met: 0 of 1
2. (unlock hero bronze_key main_door entrance)
   deleted: (locked main_door)
   goals met: 0 of 1
3. (move hero entrance hall main_door)
   deleted: (at hero entrance)
   added: (at hero hall)
   goals met: 0 of 1
4. (pick-key hero golden_key hall)
   deleted: (key-at golden_key hall)
   added: (has-key hero golden_key)
   goals met: 0 of 1
5. (unlock hero golden_key treasure_door hall)
   deleted: (locked treasure_door)
   goals met: 0 of 1
6. (move hero hall treasure_room treasure_door)
   deleted: (at hero hall)
   added: (at hero treasure_room)
   goals met: 1 of 1
